Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/help_with_buying_a_home/local_authority_mortgages.html.txt.tmx
Source language: en
Languages: ga

source: If you are unable to get a loan from a building society or bank, you may be eligible for a mortgage from your local authority
ga: Muna féidir leat iasacht a fháil ó chumann foirgníochta nó ó bhanc b'fhéidir go bhfuil tú i dteideal morgáiste ó d'údarás áitiúil

source: The loan can be up to 97% of the price of the house subject to a maximum loan of €200,000
ga: Is féidir leis an t-iasacht a bheith chomh hárd le 97% de luach an tí ach le huasmhéid iasachta de €200,000

source: A local authority mortgage will be an annuity mortgage with variable interest rates so repayments will go up and down with general interest rates
ga: Beidh morgáiste údarás áitiúil ina mhorgáiste bhliainachta le rátaí úis malartach ionas go mbeidh na haisíocaíochtaí ag dul suas agus síos le rátaí úis ginearálta

source: You may be eligible for a local authority mortgage if you can show the local authority that you cannot get a loan from a bank or building society and you are:
ga: D’fhéadfá a bheith i dteideal morgáiste ó údarás áitiúil más féidir leat a thaispeáint don údarás áitiúil nach féidir leat iasacht a fháil ó bhanc ná ó chumann foirgníochta agus:

source: • A first time buyer and
ga: • Gur ceannaitheoir céad-uaire tú agus

source: • Your income satisfies the income test - see below
ga: • Go sásaíonn d’ioncam an tástáil ioncaim - féach thíos

source: • If your gross income (before tax) in the last income tax year was €50,000 or less, you are eligible
ga: • Má bhí do oll-ioncam (roimh cháin) de €50,000 nó níos lú agat sa mbliain dheireanach cánach, tá tú i dteideal

source: • If your combined gross income (before tax) in the last income tax year was €75,000 or less, you are eligible
ga: • Má bhí do oll-ioncam (roimh cháin) de €75,000 nó níos lú agat sa mbliain dheireanach cánach, tá tú i dteideal

source: Contact your local authority
ga: Téígh i dteagmháil led' údarás áitiúil
